In [1]:
import warnings
warnings.filterwarnings('ignore')

import numpy as np
import pandas as pd

In [58]:
# OBSERVATIOSN

# You can compare a Pandas Series with an integer value 
# using standard comparison operators. When you compare a Series with an integer, 
# the comparison is done element-wise, resulting in a Boolean Series.

In [2]:
import pandas as pd

data = {'Name': ['Peets Coffee', 'Starbucks', None, 'Verve', "Dinosaur Coffee"], 
        'Neighborhood': ['Downtown', 'Hollywood', 'Silver Lake', None, 'Los Feliz'],
        'Revenue': [25000, 30000, 20000, 28000, None]}

df = pd.DataFrame(data)
df

              Name Neighborhood  Revenue
0     Peets Coffee     Downtown  25000.0
1        Starbucks    Hollywood  30000.0
2             None  Silver Lake  20000.0
3            Verve         None  28000.0
4  Dinosaur Coffee    Los Feliz      NaN

In [3]:
new_data = {
    'Name': ['Blue Bottle', 'Tully’s Coffee', 'Joe & The Juice', 'Philz Coffee', 'Dutch Bros'],
    'Neighborhood': ['Beverly Hills', 'Echo Park', 'Downtown', 'Westwood', 'Venice Beach'],
    'Revenue': [27000, 29000, 25500, 26500, 27500]
}

new_df = pd.DataFrame(new_data)

# Append new_df to the original df
df = df.append(new_df, ignore_index=True)

In [4]:
df

              Name   Neighborhood  Revenue
0     Peets Coffee       Downtown  25000.0
1        Starbucks      Hollywood  30000.0
2             None    Silver Lake  20000.0
3            Verve           None  28000.0
4  Dinosaur Coffee      Los Feliz      NaN
5      Blue Bottle  Beverly Hills  27000.0
6   Tully’s Coffee      Echo Park  29000.0
7  Joe & The Juice       Downtown  25500.0
8     Philz Coffee       Westwood  26500.0
9       Dutch Bros   Venice Beach  27500.0

In [5]:
# How would you retrieve all the unique coffee shop names 
# from the 'Name' column in the df DataFrame?

# If you wanted to know the number of unique neighborhoods 
# where the coffee shops are located, how would you determine this using the unique method and another Python function?

# How can you check if "Downtown" is a unique value in the 'Neighborhood' column?

# Can you use the unique method directly on the entire df
# DataFrame to retrieve unique rows? If not, what's the alternative?

# Imagine you wanted to process unique values in a 
# series and transform them in some way. 
# How would you retrieve unique values from the 'Revenue' column, 
# square them, and then create a new list?

In [6]:
df

              Name   Neighborhood  Revenue
0     Peets Coffee       Downtown  25000.0
1        Starbucks      Hollywood  30000.0
2             None    Silver Lake  20000.0
3            Verve           None  28000.0
4  Dinosaur Coffee      Los Feliz      NaN
5      Blue Bottle  Beverly Hills  27000.0
6   Tully’s Coffee      Echo Park  29000.0
7  Joe & The Juice       Downtown  25500.0
8     Philz Coffee       Westwood  26500.0
9       Dutch Bros   Venice Beach  27500.0

In [7]:
df['Name'].unique()

array(['Peets Coffee', 'Starbucks', None, 'Verve', 'Dinosaur Coffee',
       'Blue Bottle', 'Tully’s Coffee', 'Joe & The Juice', 'Philz Coffee',
       'Dutch Bros'], dtype=object)

In [8]:
df['Neighborhood'].nunique()

8

In [9]:
df['Neighborhood'].value_counts()

Downtown         2
Hollywood        1
Silver Lake      1
Los Feliz        1
Beverly Hills    1
Echo Park        1
Westwood         1
Venice Beach     1
Name: Neighborhood, dtype: int64

In [14]:
# How can you check if "Downtown" is a unique value in the 'Neighborhood' column?
df[df['Neighborhood'] == 'Downtown']

              Name Neighborhood  Revenue
0     Peets Coffee     Downtown  25000.0
7  Joe & The Juice     Downtown  25500.0

In [19]:
# df.unique() # doesnt work
df.drop_duplicates()

              Name   Neighborhood  Revenue
0     Peets Coffee       Downtown  25000.0
1        Starbucks      Hollywood  30000.0
2             None    Silver Lake  20000.0
3            Verve           None  28000.0
4  Dinosaur Coffee      Los Feliz      NaN
5      Blue Bottle  Beverly Hills  27000.0
6   Tully’s Coffee      Echo Park  29000.0
7  Joe & The Juice       Downtown  25500.0
8     Philz Coffee       Westwood  26500.0
9       Dutch Bros   Venice Beach  27500.0

In [21]:
# N-unique Questions

# How many unique coffee shop names are present in the 'Name' column?
# What is the total number of unique neighborhoods in the dataset?
# Are there any revenue values that appear more than once? 
# (Hint: Compare the number of unique values to the total count.)
# How many columns in the dataframe contain only unique values? 
# (Hint: Use a combination of nunique() and the shape attribute of the dataframe.)
# If you removed all rows with non-unique 'Revenue' values, 
# how many rows would the dataframe have? 
# (Hint: Use nunique() on the 'Revenue' column and compare it to the dataframe's shape.)

In [22]:
# How many unique coffee shop names are present in the 'Name' column?
df['Name'].nunique()

9

In [23]:
# What is the total number of unique neighborhoods in the dataset?
df['Neighborhood'].nunique()

8

In [32]:
# Are there any revenue values that appear more than once? 
df['Revenue'].nunique() >1

True

In [34]:
duplicate_revenues = df['Revenue'].value_counts()[df['Revenue'].value_counts() > 1]

In [39]:
df['Revenue'].value_counts()[df['Revenue'].value_counts() > 2]

Series([], Name: Revenue, dtype: int64)

In [42]:
df['Revenue'].value_counts()

25000.0    1
30000.0    1
20000.0    1
28000.0    1
27000.0    1
29000.0    1
25500.0    1
26500.0    1
27500.0    1
Name: Revenue, dtype: int64

In [43]:
# How many columns in the dataframe contain only unique values? 
# (Hint: Use a combination of nunique() and the shape attribute of the dataframe.)

In [44]:
df.shape

(10, 3)

In [50]:
df.drop_duplicates().any(axis = 0).,

Name            True
Neighborhood    True
Revenue         True
dtype: bool

In [53]:
sum(df.nunique() == df.shape[0])

0

In [54]:
df.nunique()

Name            9
Neighborhood    8
Revenue         9
dtype: int64

In [55]:
type(df.nunique())

pandas.core.series.Series

In [56]:
type(df.shape[0])

int

In [59]:
# Imagine you wanted to process unique values in a 
# series and transform them in some way. 
# How would you retrieve unique values from the 'Revenue' column, 
# square them, and then create a new list?

In [60]:
df['Revenue'].unique()

array([25000., 30000., 20000., 28000.,    nan, 27000., 29000., 25500.,
       26500., 27500.])

In [61]:
list(x**2 for x in df['Revenue'].unique())

[625000000.0,
 900000000.0,
 400000000.0,
 784000000.0,
 nan,
 729000000.0,
 841000000.0,
 650250000.0,
 702250000.0,
 756250000.0]

In [65]:
# How many columns in the dataframe contain only unique values? 
sum(df.shape[0] == df.nunique())

0

In [66]:
# If you removed all rows with non-unique 'Revenue' values, 
# how many rows would the dataframe have? 
# (Hint: Use nunique() on the 'Revenue' column and compare it to the dataframe's shape.)

In [69]:
df

              Name   Neighborhood  Revenue
0     Peets Coffee       Downtown  25000.0
1        Starbucks      Hollywood  30000.0
2             None    Silver Lake  20000.0
3            Verve           None  28000.0
4  Dinosaur Coffee      Los Feliz      NaN
5      Blue Bottle  Beverly Hills  27000.0
6   Tully’s Coffee      Echo Park  29000.0
7  Joe & The Juice       Downtown  25500.0
8     Philz Coffee       Westwood  26500.0
9       Dutch Bros   Venice Beach  27500.0

In [70]:
df.drop_duplicates(['Neighborhood'])

              Name   Neighborhood  Revenue
0     Peets Coffee       Downtown  25000.0
1        Starbucks      Hollywood  30000.0
2             None    Silver Lake  20000.0
3            Verve           None  28000.0
4  Dinosaur Coffee      Los Feliz      NaN
5      Blue Bottle  Beverly Hills  27000.0
6   Tully’s Coffee      Echo Park  29000.0
8     Philz Coffee       Westwood  26500.0
9       Dutch Bros   Venice Beach  27500.0

In [71]:
df

              Name   Neighborhood  Revenue
0     Peets Coffee       Downtown  25000.0
1        Starbucks      Hollywood  30000.0
2             None    Silver Lake  20000.0
3            Verve           None  28000.0
4  Dinosaur Coffee      Los Feliz      NaN
5      Blue Bottle  Beverly Hills  27000.0
6   Tully’s Coffee      Echo Park  29000.0
7  Joe & The Juice       Downtown  25500.0
8     Philz Coffee       Westwood  26500.0
9       Dutch Bros   Venice Beach  27500.0